## Converting Python Dictionary to Pandas DataFrame

#### Terminology

* **Dictionary**: A Python dictionary is a built-in data type that stores data in key-value pairs, allowing you to quickly retrieve values based on their associated keys. Keys in a dictionary must be immutable and unique, while values can be of any data type and can be duplicated. Dictionaries are defined using curly braces {}, with keys and values separated by colons, and items separated by commas.
* **DataFrame**: A two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns). It can be thought of as a collection of Series objects, where each Series represents a column. DataFrames are similar to a table in a relational database or an Excel spreadsheet.

In [17]:
import pandas as pd

**Examples 1-5** explore converting a Python dictionary into a Pandas DataFrame.  The original dictionary contains key/value pairs where keys are strings and values are lists.  In the default Dictionary-to-DataFrame conversion behavior, Pandas converts dictionary keys to column names and each value (list) becomes a column of data.  

This conversion example assumes that every list that constitutes a value in the dictionary has the same length.

### Example 1: Financial Data

In [15]:
stock_data = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03'],
    'AAPL': [150.75, 153.31, 155.89],
    'GOOGL': [2750.23, 2773.12, 2798.65]
}
df_stocks = pd.DataFrame(stock_data)
df_stocks

         Date    AAPL    GOOGL
0  2024-01-01  150.75  2750.23
1  2024-01-02  153.31  2773.12
2  2024-01-03  155.89  2798.65

### Example 2: Academic Grades

In [16]:
grades = {
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 92, 78],
    'Science': [90, 88, 85],
    'English': [92, 81, 89]
}
df_grades = pd.DataFrame(grades)
df_grades

   Student  Math  Science  English
0    Alice    85       90       92
1      Bob    92       88       81
2  Charlie    78       85       89

### Example 3: E-commerce Sales

In [18]:
sales_data = {
    'OrderID': [1001, 1002, 1003],
    'Product': ['Laptop', 'Smartphone', 'Tablet'],
    'Quantity': [1, 2, 1],
    'Price': [1200.00, 600.00, 450.00]
}
df_sales = pd.DataFrame(sales_data)
df_sales

   OrderID     Product  Quantity   Price
0     1001      Laptop         1  1200.0
1     1002  Smartphone         2   600.0
2     1003      Tablet         1   450.0

### Example 4: Environmental Data

In [19]:
temperature_data = {
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Temperature': [30, 75, 45],
    'Humidity': [65, 50, 70]
}
df_temperature = pd.DataFrame(temperature_data)
df_temperature

          City  Temperature  Humidity
0     New York           30        65
1  Los Angeles           75        50
2      Chicago           45        70

### Example 5: Social Media Metrics

In [20]:
social_media_data = {
    'Platform': ['Twitter', 'Facebook', 'Instagram'],
    'Likes': [120, 300, 450],
    'Shares': [15, 45, 67],
    'Comments': [23, 55, 78]
}
df_social_media = pd.DataFrame(social_media_data)
df_social_media

    Platform  Likes  Shares  Comments
0    Twitter    120      15        23
1   Facebook    300      45        55
2  Instagram    450      67        78

### Example 6: Converting a dictionary to a DataFrame with different sets of columns
The following example demonstrates how to explicitly name DataFrame columns during the Dictionary-to-DataFrame conversion process.  To achieve that, we pass an additional named parameter "columns" into the DataFrame() function/constructor.

In [31]:
grades_filtered = {
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 92, 78],
    'English': [92, 81, 89]
}
df_grades_filtered = pd.DataFrame(grades_filtered, columns=['Student', 'Math', 'English'])
df_grades_filtered

   Student  Math  English
0    Alice    85       92
1      Bob    92       81
2  Charlie    78       89

**Examples 7-9** illustrate the use of the **orient='index'** parameter. Note that in these examples the key/value pairs contains string keys and nested dictionary values.

The **orient='index'** parameter in **pandas.DataFrame()** is used when creating a DataFrame from a dictionary. When **orient='index'** is specified, the dictionary keys are treated as the index (row labels) of the DataFrame, and the dictionary values are treated as rows. This orientation is useful for creating DataFrames where the data is naturally structured in a row-wise fashion, with each key corresponding to a different row.

### Example 7: Converting a dictionary to a DataFrame with a different axis

In [32]:
grades_transposed = {
    'Alice': {'Math': 85, 'Science': 90, 'English': 92},
    'Bob': {'Math': 92, 'Science': 88, 'English': 81},
    'Charlie': {'Math': 78, 'Science': 85, 'English': 89}
}
df_grades_transposed = pd.DataFrame.from_dict(grades_transposed, orient='index')
df_grades_transposed

         Math  Science  English
Alice      85       90       92
Bob        92       88       81
Charlie    78       85       89

### Example 8: Dictionary of lists with 'index' orientation

In [33]:
dict_index_orient = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03'],
    'AAPL': [150.75, 153.31, 155.89],
    'GOOGL': [2750.23, 2773.12, 2798.65]
}
df_index_orient = pd.DataFrame.from_dict(dict_index_orient, orient='index')
df_index_orient

                0           1           2
Date   2024-01-01  2024-01-02  2024-01-03
AAPL       150.75      153.31      155.89
GOOGL     2750.23     2773.12     2798.65

### Example 9: Dictionary of dictionaries with 'index' orientation

In [34]:
dict_dict_index_orient = {
    '2024-01-01': {'AAPL': 150.75, 'GOOGL': 2750.23},
    '2024-01-02': {'AAPL': 153.31, 'GOOGL': 2773.12},
    '2024-01-03': {'AAPL': 155.89, 'GOOGL': 2798.65}
}
df_dict_index_orient = pd.DataFrame.from_dict(dict_dict_index_orient, orient='index')
df_dict_index_orient

              AAPL    GOOGL
2024-01-01  150.75  2750.23
2024-01-02  153.31  2773.12
2024-01-03  155.89  2798.65

### Example 10: Dictionary of Series with 'columns' orientation

**The orient='columns'** parameter in **pandas.DataFrame()** is used when creating a DataFrame from a dictionary, and it is actually the default orientation. When orient='columns' is specified, the dictionary keys are treated as column labels of the DataFrame, and the dictionary values are treated as columns. This orientation is useful for creating DataFrames where the data is naturally structured in a column-wise fashion, with each key corresponding to a different column.

In [26]:
dict_series_columns_orient = {
    'Math': pd.Series([85, 92, 78], index=['Alice', 'Bob', 'Charlie']),
    'Science': pd.Series([90, 88, 85], index=['Alice', 'Bob', 'Charlie']),
    'English': pd.Series([92, 81, 89], index=['Alice', 'Bob', 'Charlie'])
}
df_series_columns_orient = pd.DataFrame.from_dict(dict_series_columns_orient, orient='columns')
df_series_columns_orient

         Math  Science  English
Alice      85       90       92
Bob        92       88       81
Charlie    78       85       89